000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПолитикиУчетаСерий/ПолитикиУчетаСерий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПолитикиУчетаСерий</name>
  <attributes>
    <name>УказыватьПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеВРозницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеКлиенту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеКомплектовДляРазборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеКомплектующихДляСборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеПоВозвратуПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтгрузкеПоПеремещению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриОтраженииИзлишковНедостачПорчи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПересчетеТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеКомплектующихПослеРазборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеОтПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеПоВозвратуОтКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеПоПеремещению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПриПриемкеСобранныхКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПолитикиУчетаСерий/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	УстановитьДоступность(ЭтотОбъект);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ


&НаКлиенте
Процедура УказыватьПриПриемкеПриИзменении(Элемент)
	Если Не Объект.УказыватьПриПриемке Тогда
		
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки = Ложь;
		Объект.УказыватьПриПриемкеОтПоставщика               = Ложь;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента        = Ложь;
		Объект.УказыватьПриПриемкеПоПеремещению              = Ложь;
		Объект.УказыватьПриПриемкеСобранныхКомплектов        = Ложь;
		
	КонецЕсли;
	
	УстановитьДоступность(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УказыватьПриОтгрузкеПриИзменении(Элемент)
	Если Не Объект.УказыватьПриОтгрузке Тогда
		
		Объект.УказыватьПриОтгрузкеКлиенту                = Ложь;
		Объект.УказыватьПриОтгрузкеВРозницу               = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Ложь;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Ложь;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Ложь;
		
		НастройкаУказанияСерийПриОтгрузке = 0;
	Иначе
		НастройкаУказанияСерийПриОтгрузке = 3;
	КонецЕсли;
	
	УстановитьДоступность(ЭтотОбъект);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Результат = ОткрытьФормуМодально("Справочник.ПолитикиУчетаСерий.Форма.РазблокированиеРеквизитов");
		Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
			
			Если ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект) Тогда
				ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Результат);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступность(Форма)
	
	Форма.Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность        = Форма.Объект.УказыватьПриПриемке;
	Форма.Элементы.УказыватьПриПриемкеОтПоставщика.Доступность               = Форма.Объект.УказыватьПриПриемке;
	Форма.Элементы.УказыватьПриПриемкеПоПеремещению.Доступность              = Форма.Объект.УказыватьПриПриемке;
	Форма.Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность        = Форма.Объект.УказыватьПриПриемке;
	Форма.Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность = Форма.Объект.УказыватьПриПриемке;
	
	Форма.Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Форма.Объект.УказыватьПриОтгрузке;
	
	Форма.Элементы.УказыватьПриОтраженииИзлишковНедостачПорчи.Доступность = Истина;
	Форма.Элементы.УказыватьПриПересчетеТоваров.Доступность               = Истина;
	Форма.Элементы.УказыватьПриПриемке.Доступность                        = Истина;
	Форма.Элементы.УказыватьПриОтгрузке.Доступность                       = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры
